In [5]:
import pandas as pd
import numpy as np
a=pd.DataFrame([['Lion',200],['cheetah',350],['Tiger',400],['Lion',270]],columns=['Animal','Speed'])
print(a)

    Animal  Speed
0     Lion    200
1  cheetah    350
2    Tiger    400
3     Lion    270

In [6]:
a.groupby(['Animal']).mean()

         Speed
Animal
Lion     235.0
Tiger    400.0
cheetah  350.0

In [7]:
a.groupby(['Animal']).sum()

         Speed
Animal
Lion       470
Tiger      400
cheetah    350

In [8]:
a.groupby(['Animal']).count()

         Speed
Animal
Lion         2
Tiger        1
cheetah      1

In [9]:
a.groupby(['Animal']).first()

         Speed
Animal
Lion       200
Tiger      400
cheetah    350